class Messages:

    START_MSG = (
        "سلام {}.\n\nمن ربات آپلودکننده یوتیوب هستم. شما می توانید از من برای آپلود هر ویدیوی تلگرام در یوتیوب استفاده کنید "
         "وقتی به من اجازه دادید. می توانید از /help بیشتر بدانید.\n\nاز شما متشکرم."
    )

    HELP_MSG = [
        ".",
        "سلام.\n\nاول از همه. باید بدانید که یوتیوب تک تک ویدیوهای آپلود شده را پردازش می کند. "
        "و هوش مصنوعی آن شگفت‌انگیز است که در صورت یافتن محتوای دارای حق نسخه‌برداری به محض اینکه ویدیو را پیدا کرد، آن را برای کپی رایت پرچم‌گذاری می‌کند "
        "آپلود شده است، و شما نمی توانید ویدیو را منتشر کنید.\n\nتمام صفحات را بخوانید تا بدانید من چگونه کار می کنم. ",
        "**بیایید یاد بگیریم که چگونه کار می کنم.**\n\n**مرحله 1:** __شما به من اجازه می دهید در کانال یوتیوب خود آپلود کنم. اطلاعات بیشتر درباره "
        "این در صفحات بعدی.__\n\n**مرحله 2:** _ شما هر ویدیوی تلگرام را برای من فوروارد میکنید.__\n\n**مرحله 3:** _ شما پاسخ میدهید "
        "__/upload __به فایل ویدئویی ارسال شده. همچنین می توانید عنوانی را در دستور آپلود مشخص کنید، اما "
        "هر چند اختیاری است. عنوان از __`/upload` پیروی می کند.__اگر عنوانی داده نشود، نام فایل به عنوان عنوان استفاده می شود.__ "
        "\n\n**مرحله 4:** __من فایل را از راه دور دانلود می کنم و در کانال یوتیوب شما آپلود می کنم.__\n\n**مرحله 5:** __I "
        "پس از آپلود لینک یوتیوب را برای شما ارسال می کند.__ ",
        "**کانال یوتیوب خود را ایجاد کنید**\n\nاگر کانال یوتیوب ندارید استفاده از من فایده ای ندارد. پس بروید "
        "از طریق مراحل داده شده برای ایجاد یکی.\n\n**مرحله 1:** __در رایانه یا با استفاده از تلفن همراه به YouTube وارد شوید."
        "__\n\n**مرحله 2:** __هر اقدامی که نیاز به کانال دارد را امتحان کنید، مانند آپلود یک ویدیو، ارسال نظر، "
        "یا ایجاد یک لیست پخش.__\n\n**مرحله 3:** __اگر هنوز کانالی ندارید، یک درخواست برای ایجاد خواهید دید. "
        "یک کانال.__\n\n**مرحله 4:** __جزئیات را بررسی کنید و برای ایجاد کانال جدید خود تأیید کنید.__",
        "**حساب YouTube خود را تأیید کنید **\on\Youtube هرزنامه و سوء استفاده را بسیار جدی بگیرید. بنابراین از شما خواسته می شود که تأیید کنید "
        "حساب یوتیوب شما هنگامی که حساب خود را تأیید کردید، می‌توانید ویدیوهای طولانی‌تر از 15 را آپلود کنید "
        " دقایق. اگر حساب خود را تأیید نکرده باشید، هر ویدیوی آپلود شده که بیش از 15 دقیقه است تأیید می شود"
        "حذف شد.\n[حساب YouTube خود را اینجا تأیید کنید.](http://www.youtube.com/verify)\n\n__به خاطر بسپارید "
        "پروژه، در غیر این صورت آپلودهای شما خصوصی خواهند ماند.__",
        "**حالا اجازه دهید\شما باید به من اجازه دسترسی آپلود ویدیوها به حساب کاربری یوتیوب خود را بدهید. برای این کار "
        "لینک داده شده را باز کنید و اجازه دسترسی بدهید و کد را کپی کنید. به اینجا برگردید و «/authorise copied-code» را تایپ کنید و "
        "آن را بفرست.\n\n**نترس!**\nمن یک هکر یا کسی نیستم که بخواهم به حریم خصوصی مردم نفوذ کنم. من احترام "
        "حریم شخصی من اینجا هستم فقط برای کمک به هر کسی که کمک می خواهد. اگر من هکر بودم اینجا نمی نشینم "
        "نوشتن ربات های تلگرام.",
    ]

    NOT_A_REPLY_MSG = "لطفا به چند فایل ویدیویی پاسخ دهید."

    NOT_A_MEDIA_MSG = "هیچ فایل رسانه ای یافت نشد." + NOT_A_REPLY_MSG

    NOT_A_VALID_MEDIA_MSG = "این یک رسانه معتبر نیست"

    DAILY_QOUTA_REACHED = "به نظر می‌رسد امروز می‌خواهید بیش از ۶ ویدیو آپلود کنید! به طور پیش فرض فقط یوتیوب "
     "حدود 6 بار در روز اجازه می دهد، بنابراین این درخواست ممکن است شکست بخورد!!"

    PROCESSING = "در حال پردازش....."

    NOT_AUTHENTICATED_MSG = "شما به من احراز هویت برای آپلود ویدیو در هیچ حسابی نرسیده اید. برای احراز هویت / help را ببینید"

    NO_AUTH_CODE_MSG = "هیچ کدی وجود ندارد. لطفا یک کد ارائه دهید"

    AUTH_SUCCESS_MSG = "تبریک می گویم، شما با موفقیت مرا برای آپلود در یوتیوب تأیید کردید.\nآپلود مبارک!"

    AUTH_FAILED_MSG = "احراز هویت انجام نشد\nجزئیات:{}"

    AUTH_DATA_SAVE_SUCCESS = "داده های احراز هویت داده شده با موفقیت ذخیره شد!"
